/*------------------------------------------------------------------------------
|	タイトル：		入力関数
|	ファイル名：	input.cpp
|	作成者：		AT12A244 33 CHIN HIU
|	作成日：		2015/06/01
------------------------------------------------------------------------------*/

/*------------------------------------------------------------------------------
|	更新履歴:
------------------------------------------------------------------------------*/

/*------------------------------------------------------------------------------
|	インクルードファイル
------------------------------------------------------------------------------*/
#include "input.h"
#include "keyboard.h"
#include "mouse.h"
#include "joystick.h"

/*------------------------------------------------------------------------------
|	マクロ定義
------------------------------------------------------------------------------*/

/*------------------------------------------------------------------------------
|	グローバル変数
------------------------------------------------------------------------------*/
LPDIRECTINPUT8			g_pInput		= NULL;					//IDirectInput8インターフェースへのポインタ

/*------------------------------------------------------------------------------
|	プロトタイプ宣言
------------------------------------------------------------------------------*/
HRESULT	InitMouse( HINSTANCE hInstance, HWND hWnd );
void	UninitMouse( void );
void	UpdateMouse( void );

/*------------------------------------------------------------------------------
|	入力の初期化処理
------------------------------------------------------------------------------*/
HRESULT InitInput( HINSTANCE hInstance, HWND hWnd )
{
	if( g_pInput == NULL )
	{
		//DirectInputオブジェクトの作成
		if( FAILED(
			DirectInput8Create
			(
				hInstance,
				DIRECTINPUT_VERSION,
				IID_IDirectInput8,
				( void** )&g_pInput,
				NULL
			) ) )
		{
			MessageBox( hWnd, "DirectInput8オブジェクトの作成できませんでした。", "警告！", MB_ICONWARNING );
			return E_FAIL;
		}
	}

	//キーボードの初期化
	InitKeyboard( hInstance, hWnd );

	//マウスの初期化
	//InitMouse( hInstance, hWnd );

	//ジョイスティックの初期化
	InitJoysticks( hInstance, hWnd );

	return S_OK;
}

/*------------------------------------------------------------------------------
|	入力の終了処理
------------------------------------------------------------------------------*/
void UninitInput( void )
{
	if( g_pInput!= NULL )
	{	//インターフェースを開放
		g_pInput -> Release();
		g_pInput = NULL;
	}

	//キーボードの終了処理
	//UninitKeyboard();

	//マウスの終了処理
	//UninitMouse();

	//ジョイスティックの終了処理
	UninitJoysticks();
}

/*------------------------------------------------------------------------------
|	入力処理の更新処理
------------------------------------------------------------------------------*/
void UpdateInput( void )
{
	//キーボードの更新
	UpdateKeyboard();

	//マウスの更新
	//UpdateMouse();

	//ジョイスティックの更新
	UpdateJoysticks();
}

/*------------------------------------------------------------------------------
|	インターフェースへのポインタを取得
------------------------------------------------------------------------------*/
LPDIRECTINPUT8 GetpInput( void )
{
	return g_pInput;
}