/*******************************************************************************
* タイトル： ツール描画関数
* ファイル名： propshow	.h
* 作成者： AT12A244 46 LIHAOSHENG
* 作成日： 2015/12/15
*******************************************************************************/

/*******************************************************************************
* 更新履歴：
*******************************************************************************/
#ifndef _PROPMP_H_
#define _PROPMP_H_

//*------------------------------------------------------------------------------
//|	マクロ定義
//------------------------------------------------------------------------------*/
#define MAX_PROP_MP	(1) //ツールの数量
#define PROP_WIDTH ( 15.0f ) //ツールの幅
#define PROP_HEIGHT ( 30.0f ) //ツールの高さ
#define PROP_LEFT ( 15.0f) //左方向移動
//*****************************************************************************
// 構造体定義
//*****************************************************************************
typedef struct
{
	D3DXVECTOR3 pos;	// 位置
	D3DXVECTOR3 rot;	// 向き
	D3DXVECTOR3 move;	// 移動量
	D3DXCOLOR col;		// 色
	bool bUse;			// 使用しているかどうか
} PROPMP;
//プロトタイプ宣言
HRESULT InitPropMp (void);
void UninitPropMp (void);
void UpdatePropMp (void);
void DrawPropMp (void);
PROPMP *GetPropMp( void );
#endif