/*******************************************************************************
		インクルードの重複読み込み防止

*******************************************************************************/

/*******************************************************************************
* 更新履歴：2016/02/23
*******************************************************************************/

/*******************************************************************************
* 更新履歴：
*******************************************************************************/

#ifndef _RANKING_H_
#define _RANKING_H_

/*******************************************************************************
* マクロ定義
*******************************************************************************/
#define RANKINGSCORE_MAX ( 6 )			//スコアの桁数
#define RANKINGSCORE_WIDTH ( 35.0f )	//スコアの幅
#define RANKINGSCORE_HEIGHT ( 70.0f )	//スコアの高
#define RANKINGSCORE_POSX ( 400.0f )	//スコアの左の桁X座標
#define RANKINGSCORE_POSY ( 100.0f )	//スコアの左の桁Y座標

#define RANKING_MAX ( 5 )				//ランキングの最大数

#define RANKING_FILE "ranking.bin"		//保存ファイル名

/*******************************************************************************
* 構造体定義
*******************************************************************************/
typedef struct
{
	int nScore;		//スコア
}RANKING;
//プロトタイプの宣言
HRESULT InitRanking( void );
void UninitRanking( void );
void UpdateRanking( void );
void DrawRanking( void );
void SaveRanking( void );
void LoadRanking( void );
void CompareRanking( void );
HRESULT Powi( int x, int y );
#endif