/*******************************************************************************
		インクルードの重複読み込み防止

*******************************************************************************/
#ifndef	_SKY_H_
#define	_SKY_H_

/*******************************************************************************
* マクロ定義
*******************************************************************************/
#define MAX_SKY ( 1 )                     // 建物の数
#define POSMOVE_SKY	( 0.0f )		// 建物移動量

/*******************************************************************************
* 構造体宣言
*******************************************************************************/
typedef struct
{
	LPDIRECT3DTEXTURE9 pTextureSky;       // テクスチャへのポインタ
	LPD3DXBUFFER pBuffMatSky;             // 頂点バッファへのポインタ
	LPD3DXMESH pMeshSky;                  // メッシュの情報
	DWORD nNumMatSky;                     // マテリアル数
	D3DXMATRIX mtxWorldSky;               // ワールドマトリックス

	bool bUse;              // 使用しているかどうか

	D3DXVECTOR3 pos;        // 位置
	D3DXVECTOR3 rot;        // 現在の向き
	D3DXVECTOR3 scl;        // スケール値
	D3DXVECTOR3 Max;        // 頂点座標の最大値
	D3DXVECTOR3 Min;        // 頂点座標の最小値
	D3DXVECTOR3 Size;       // MaxとMinの絶対値を足して２で割ったもの。また衝突判定で使うモデルの半径。x:幅 y:高さ z:奥行き。
	float Collisoin;        // 衝突判定で使う長さ。sizeのxとzで、大きかった方を衝突判定に使う。
	float			fPosMove;	//移動量
} SKY;
/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/
HRESULT InitSky( void );
void UninitSky( void );
void UpdateSky( void );
void DrawSky( void );

SKY *GetSky( void );
#endif