#include "main.h"
#include "time.h"
#include "camera.h"
//グローバル変数
TIME g_time;
//=============================================================================
//  関数名　：InitTime
//  機能概要：Timeの初期化
//  戻り値　：
//=============================================================================
void InitTime(void)
{
	g_time.time =0 ;
	g_time.frame = 0;
}
//=============================================================================
//  関数名　：UninitTime
//  機能概要：Timeの終了処理
//  戻り値　：
//=============================================================================
void UninitTime(void)
{

}
//=============================================================================
//  関数名　：DrawTime
//  機能概要：Timeの描画処理
//  戻り値　：
//=============================================================================
void DrawTime(void)
{

}
//=============================================================================
//  関数名　：UpdateTime
//  機能概要：Timeの更新処理
//  戻り値　：
//=============================================================================
void UpdateTime(void)
{
		if(g_time.frame>=60)
		{
			g_time.time ++;
			g_time.frame = 0;
		}
		else
		{
			g_time.frame++;
		}

}
TIME *GetTime( void )
{
	return &g_time;
}