#include "main.h"
#include "title.h"
#include "titlebg.h"
#include "press.h"
#include "fade.h"
#include "keyboard.h"
#include "sound.h"
//=============================================================================
//  関数名　：InitTitle
//  機能概要：プリゴンの初期化
//  戻り値　：HRESULT
//=============================================================================
void InitTitle (void)
{
	PlaySound(SOUND_LABEL_BGM000);

	InitTitleBg();
	InitPress();
}
//=============================================================================
//  関数名　：UninitTitle
//  機能概要：プリゴンの終了処理
//  戻り値　：
//=============================================================================
void UninitTitle(void)
{
	UninitTitleBg();
	UninitPress();
}
//=============================================================================
//  関数名　：DrawTitle
//  機能概要：プリゴンの描画処理
//  戻り値　：
//=============================================================================
void DrawTitle(void)
{
	DrawTitleBg();
	DrawPress();
}
//=============================================================================
//  関数名　：UpdateTitle
//  機能概要：プリゴンの更新処理
//  戻り値　：
//=============================================================================
void UpdateTitle(void)
{
	MODE mode;
	mode = GetMode();
	UpdateTitleBg();
	UpdatePress();
}